[
  {
    "id": "c4805a8e-97de-4b35-b1dd-cf251ba327aa",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c4805a8e-97de-4b35-b1dd-cf251ba327aa",
    "created_at": "Tue Apr 20 15:59:37 UTC 2021",
    "company": "Literally Media",
    "company_url": "https://literally.media",
    "location": "Remote",
    "title": "Full Stack - Ruby on Rails Developer",
    "description": "<p>About the Company:\nLiterally Media is a digital publishing house that owns and operates a collection of highly successful humor and entertainment websites. The portfolio of legendary digital brands includes eBaum’s World, Cheezburger, Know Your Meme, and Cracked, which dominate the entertainment market with over 50 million organic users a month.</p>\n<p>Be part of the most exciting and fulfilling company in the local digital media space, where we reach millions of people across the world with fun, entertaining brands they keep coming back to. This is a full-time position based remotely, with the option to work out of our offices in Brooklyn, NY.</p>\n<p>Job Description:\nLiterally Media is searching for an experienced, full time, Ruby on Rails web developer to join the KnowYourMeme team. Responsibilities include the full-stack ownership and development of the KnowYourMeme application, platform, and infrastructure. Ideal candidates include self-starters with a passion for internet and technology, with an emphasis on supporting the growth of the site, brand, and community.</p>\n<p>This mid-senior level position comes with a lot of responsibility. You will be architecting and implementing site features in their entirety which will then be served to tens of millions of users per month. You will report to our Head of Product &amp; Technology and work closely with various teams throughout the organization.</p>\n<p>About Development at Literally Media:\nAt Literally Media, we work together to craft software and features that make us proud. We care about our customers and strive to meet the needs of the Monetization, Business and Editorial teams.</p>\n<p>As a developer for KnowYourMeme, you’ll work with a small team of focused individuals who are serious about making a great product; and even more serious about having a great time interacting with our various teams spanning the globe. Every member of our team is vital and has the opportunity to influence the direction of the product, architecture, and the company at large.\nWe are an agile organization that embraces iterative development &amp; continuous deployment with a key focus on data-driven decision making.</p>\n<p>Must Haves (Basic Qualifications):</p>\n<p>●  At least 5 years of proven experience working as a software developer</p>\n<p>●  Applied knowledge and understanding of our Platform specifications (see below)</p>\n<p>●  Experience developing on front &amp; backend consumer facing websites</p>\n<p>●  Experience with Ruby on Rails, Commonly used Gems, MVC, and interfacing with front end technologies such as HTML, HAML, CSS, and Javascript</p>\n<p>●  Familiarity with commonly used front-end libraries, frameworks and tools</p>\n<p>●  Experience with Agile development practices</p>\n<p>●  Familiar with UX &amp; UI best principles, with a keen eye for mobile and desktop design</p>\n<p>●  Proficient in architecting and integrating with a wide variety of web service APIs</p>\n<p>●  Proficient understanding of code versioning with git</p>\n<p>●  Proficient operating in a Linux environment</p>\n<p>●  A very high degree of intellectual curiosity, and a passion for software development</p>\n<p>Optional (Nice to Have):</p>\n<p>●  Work experience with an online digital publisher</p>\n<p>●  Experience with DFP, Header Bidding, and Native Advertising</p>\n<p>●  Experience with Google Analytics</p>\n<p>●  An analytical mindset to facilitate the data-driven company needs</p>\n<p>●  Interest in Internet &amp; Meme culture</p>\n<p>●  Experience integrating with Social Platforms (Facebook, Twitter, Pinterest)</p>\n<p>●  BS/MS degree in Computer Science, Engineering or in a related field a plus</p>\n<p>Our Platform:\n●  Language: Ruby\n●  Framework: Ruby on Rails\n●  Databases: MySQL, Redis\n●  Caching: Memcache\n●  Infrastructure: Self hosted, Ubuntu, Nginx/Unicorn web servers\n●  HAProxy Load Balancer\n●  Front End: Bootstrap, HAML\n●  Images: ImageMagick for processing, s3 for storage\n●  CDN\n●  Deployment: Capistrano Ruby gem (SSH &amp; Git)</p>\n",
    "how_to_apply": "<p>Email you resume to: <a href=\"mailto:careers@literally.media\">careers@literally.media</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWloIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4c4cfa24d3d58784b8f8fd7b1750edf4712924cc/Literally%20Logo%20.png"
  }
]
